#####浅拷贝：在复制过程中，只复制一层变量，不会复制深层变量绑定的对象的复制过程

L=[3.1,3.2]
L1=[1,2,L]
print("L1值：",L1)  #L1值： [1, 2, [3.1, 3.2]]
L2=L1.copy()
L[0]=3.14
print("L1值：",L1)  #L1值： [1, 2, [3.14, 3.2]]
print("L2值：",L2)  #L1值： [1, 2, [3.14, 3.2]]
#L1[2]和 L2[2]共同拥有L绑定的对象

#####深拷贝：
print("=======深拷贝=========")
import copy
L=[3.1,3.2]
L1=[1,2,L]
print("L1值：",L1)  #L1值： [1, 2, [3.1, 3.2]]
L2=copy.deepcopy(L1)
L[0]=3.14
print("L1值：",L1)  #L1值： [1, 2, [3.14, 3.2]]
print("L2值：",L2)  #L1值： [1, 2, [3.1, 3.2]]

#理解的问题
L1=[1 ,2 ,[3.1 , 3.2]]
L2=L1
L3=L1.copy()
L4=copy.deepcopy(L1)
#问题：如何把L1里面的3.1改为3.14


















